{"config": [{"config": {"trainable": true, "dtype": "float32", "name": "zero_padding2d_1", "padding": [[2, 2], [2, 2]], "data_format": "channels_last", "batch_input_shape": [1, 50, 50, 1]}, "class_name": "ZeroPadding2D"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv1_1", "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [5, 5], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 8, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": [[2, 2], [2, 2]], "name": "zero_padding2d_2", "data_format": "channels_last"}, "class_name": "ZeroPadding2D"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv1_2", "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [5, 5], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 8, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "padding": [[2, 2], [2, 2]], "name": "zero_padding2d_3", "data_format": "channels_last"}, "class_name": "ZeroPadding2D"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2_1", "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [5, 5], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 16, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": [[2, 2], [2, 2]], "name": "zero_padding2d_4", "data_format": "channels_last"}, "class_name": "ZeroPadding2D"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2_2", "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [5, 5], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 16, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [5, 5], "name": "max_pooling2d_2", "padding": "valid", "strides": [5, 5], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "padding": [[2, 2], [2, 2]], "name": "zero_padding2d_5", "data_format": "channels_last"}, "class_name": "ZeroPadding2D"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3_1", "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [5, 5], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 40, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": [[2, 2], [2, 2]], "name": "zero_padding2d_6", "data_format": "channels_last"}, "class_name": "ZeroPadding2D"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv3_2", "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_constraint": null, "kernel_size": [5, 5], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "filters": 32, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_1", "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "activation": "linear", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 512, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_2", "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "activation": "linear", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 512, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_2", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.15, "name": "dropout_3", "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "activation": "linear", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 512, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_3", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.1, "name": "dropout_4", "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4", "activation": "linear", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 512, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_5", "activation": "linear", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 512, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_6", "activation": "linear", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 512, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_6", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_7", "activation": "linear", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 512, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_7", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_8", "activation": "linear", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 512, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_8", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_9", "activation": "linear", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 10, "bias_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_9", "activation": "sigmoid"}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential"}